============
line comment
============

// just a comment

---
(source_file
  (comment))

========================
simple multi-line string
========================

"Lorem ipsum
dolor sit amet"

---
(source_file
  (string))

===========
hash string
===========

"#"

---
(source_file
  (string))

===============================
string with an escape character
===============================

"\""

---
(source_file
  (string
    (escape_sequence)))

==============
integer number
==============

123

---
(source_file
  (number))

============
simple float
============

123.456

---
(source_file
  (number))

============================================
float without digits after the decimal point
============================================

0.

---
(source_file
  (number))

===============================
float in exponential notation 1
===============================

1e3

---
(source_file
  (number))

===============================
float in exponential notation 2
===============================

1e-3

---
(source_file
  (number))

===============================
float in exponential notation 3
===============================

60E9

---
(source_file
  (number))

===============================
float in exponential notation 4
===============================

-7.9e-05

---
(source_file
  (number))

===============================
float in exponential notation 5
===============================

1e+009

---
(source_file
  (number))

===============================
float in exponential notation 6
===============================

-1.04858e+011

---
(source_file
  (number))

===========
description
===========

DESCRIPTION "My Description";

---
(source_file
  (description (string)))

=======
include
=======

INCLUDE external_file.inc
INCLUDE ../etc/other.inc

---
(source_file
  (include (file_name))
  (include (file_name)))

================
simple help file
================

HELPFILE "my_help_file.hlp";

---
(source_file
  (help_file
    (file_name)))

=================
complex help file
=================

HELPFILE "my_help_file.hlp",
  OPEN_FILE "my_help.html" HELPKEY("my_key"),
  OPEN_URL "https://www.example.com/";

---
(source_file
  (help_file
    (file_name)
    (open_file
      (file_name)
      (help_file_option
        (string)))
    (open_url
      (document_url))))

===========
user groups
===========

USERGROUPS
  some_user ("me", "you"),
  admin ("someone");

---
(source_file
  (user_groups
    (user_group
      (identifier)
      (string)
      (string))
    (user_group
      (identifier)
      (string))))

==============
end of program
==============

END.

---
(source_file
  (end_statement))
