====================
empty datapool block
====================

DATAPOOL
END DATAPOOL;

---
(source_file
  (datapool_block))

=========================
primitive type definition
=========================

DATAPOOL
  CDATA a;
  COLOR b;
  COMPLEX c;
  INTEGER d;
  REAL e;
  STRING f;
END DATAPOOL;

---
(source_file
  (datapool_block
    (variable_definition (primitive_type) (variable_identifier))
    (variable_definition (primitive_type) (variable_identifier))
    (variable_definition (primitive_type) (variable_identifier))
    (variable_definition (primitive_type) (variable_identifier))
    (variable_definition (primitive_type) (variable_identifier))
    (variable_definition (primitive_type) (variable_identifier))))

============================
multiple variable definition
============================

DATAPOOL
  INTEGER a, b, c;
END DATAPOOL;

---
(source_file
  (datapool_block
    (variable_definition
      (primitive_type)
        (variable_identifier) (variable_identifier) (variable_identifier))))

====================================
variable definitions with parameters
====================================

DATAPOOL
  INTEGER {EDITABLE}
    foo {TOGGLE, BUTTON},
    bar {RADIO};
END DATAPOOL;

---
(source_file
  (datapool_block
    (variable_definition
      (primitive_type)
        (parameter_block (parameter))
        (variable_identifier) (parameter_block (parameter) (parameter))
        (variable_identifier) (parameter_block (parameter)))))

=======================
variable with dimension
=======================

DATAPOOL
  INTEGER foo[3];
END DATAPOOL;

---
(source_file
  (datapool_block
    (variable_definition
      (primitive_type)
        (variable_identifier) (dimension (number)))))

=======================================
variable with dimensions and parameters
=======================================

DATAPOOL
  INTEGER foo[3, 4] {TOGGLE};
END DATAPOOL;

---
(source_file
  (datapool_block
    (variable_definition
      (primitive_type)
      (variable_identifier)
        (dimension (number) (number))
        (parameter_block (parameter)))))

================
set definition 1
================

DATAPOOL
  SET myset1 ("1", "2"),
      myset2 ("3", "4");
END DATAPOOL;

---
(source_file
  (datapool_block
    (sets_definition
      (set_definition (set_identifier) (set_item (string)) (set_item (string)))
      (set_definition (set_identifier) (set_item (string)) (set_item (string))))))

================
set definition 2
================

DATAPOOL
  SET myset ("A" = 1, "B" = 2);
END DATAPOOL;

================
set definition 3
================

DATAPOOL
  SET myset ("A" = "a", "B" = "b");
END DATAPOOL;
