====================
empty datapool block
====================

DATAPOOL
END DATAPOOL;

---
(source_file
  (datapool_block))

=========================
primitive type definition
=========================

DATAPOOL
  CDATA a;
  COLOR b;
  COMPLEX c;
  INTEGER d;
  REAL e;
  STRING f;
END DATAPOOL;

---
(source_file
  (datapool_block
    (variable_definition (primitive_type) (variable_identifier))
    (variable_definition (primitive_type) (variable_identifier))
    (variable_definition (primitive_type) (variable_identifier))
    (variable_definition (primitive_type) (variable_identifier))
    (variable_definition (primitive_type) (variable_identifier))
    (variable_definition (primitive_type) (variable_identifier))))

============================
multiple variable definition
============================

DATAPOOL
  INTEGER a, b, c;
END DATAPOOL;

---
(source_file
  (datapool_block
    (variable_definition
      (primitive_type)
        (variable_identifier) (variable_identifier) (variable_identifier))))

====================================
variable definitions with parameters
====================================

DATAPOOL
  INTEGER {EDITABLE}
    foo {TOGGLE, BUTTON},
    bar {RADIO};
END DATAPOOL;

---
(source_file
  (datapool_block
    (variable_definition
      (primitive_type)
        (parameter_block (parameter))
        (variable_identifier) (parameter_block (parameter) (parameter))
        (variable_identifier) (parameter_block (parameter)))))

=======================
variable with dimension
=======================

DATAPOOL
  INTEGER foo[3];
END DATAPOOL;

---
(source_file
  (datapool_block
    (variable_definition
      (primitive_type)
        (variable_identifier) (dimension (number)))))

=======================================
variable with dimensions and parameters
=======================================

DATAPOOL
  INTEGER foo[3, 4] {TOGGLE};
END DATAPOOL;

---
(source_file
  (datapool_block
    (variable_definition
      (primitive_type)
      (variable_identifier)
        (dimension (number) (number))
        (parameter_block (parameter)))))

====================
empty set definition
====================

DATAPOOL
  SET myset ();
END DATAPOOL;

---
(source_file
  (datapool_block
    (set_definition
      (set_identifier))))
