====================
empty datapool block
====================

DATAPOOL
END DATAPOOL;

---
(source_file
  (datapool_block))

==========================
primitive type declaration
==========================

DATAPOOL
  CDATA a;
  COMPLEX c;
  INTEGER d;
  REAL e;
  STRING f;
END DATAPOOL;

---
(source_file
  (datapool_block
    (variables_declaration (primitive_type) (variable_declaration (variable_identifier)))
    (variables_declaration (primitive_type) (variable_declaration (variable_identifier)))
    (variables_declaration (primitive_type) (variable_declaration (variable_identifier)))
    (variables_declaration (primitive_type) (variable_declaration (variable_identifier)))
    (variables_declaration (primitive_type) (variable_declaration (variable_identifier)))))

=============================
multiple variable declaration
=============================

DATAPOOL
  INTEGER a, b, c;
END DATAPOOL;

---
(source_file
  (datapool_block
    (variables_declaration
      (primitive_type)
        (variable_declaration (variable_identifier))
        (variable_declaration (variable_identifier))
        (variable_declaration (variable_identifier)))))

=====================================
variable declarations with parameters
=====================================

DATAPOOL
  INTEGER {EDITABLE}
    foo {TOGGLE, BUTTON},
    bar {RADIO};
END DATAPOOL;

---
(source_file
  (datapool_block
    (variables_declaration
      (primitive_type)
        (parameter_block (parameter))
        (variable_declaration (variable_identifier) (parameter_block (parameter) (parameter)))
        (variable_declaration (variable_identifier) (parameter_block (parameter))))))

=====================================================
variable declarations with parameters and assignments
=====================================================

DATAPOOL
  INTEGER {EDITABLE}
    foo { LABEL="mylabel", TOGGLE, FUNC=myfunc };
END DATAPOOL;

---
(source_file
  (datapool_block
    (variables_declaration
      (primitive_type)
      (parameter_block
        (parameter))
      (variable_declaration
        (variable_identifier)
        (parameter_block
          (parameter_assignment
            (parameter)
            (string))
          (parameter)
          (parameter_assignment
            (parameter)
            (identifier)))))))

=======================
variable with dimension
=======================

DATAPOOL
  INTEGER foo[3];
END DATAPOOL;

---
(source_file
  (datapool_block
    (variables_declaration
      (primitive_type)
        (variable_declaration (variable_identifier) (dimension (number))))))

=======================================
variable with dimensions and parameters
=======================================

DATAPOOL
  INTEGER foo[3, 4] {TOGGLE};
END DATAPOOL;

---
(source_file
  (datapool_block
    (variables_declaration
      (primitive_type)
      (variable_declaration
        (variable_identifier)
        (dimension (number) (number))
        (parameter_block (parameter))))))

=================
set declaration 1
=================

DATAPOOL
  SET myset1 ("1", "2"),
      myset2 ("3", "4");
END DATAPOOL;

---
(source_file
  (datapool_block
    (sets_declaration
      (set_declaration (set_identifier) (set_item (string)) (set_item (string)))
      (set_declaration (set_identifier) (set_item (string)) (set_item (string))))))

=================
set declaration 2
=================

DATAPOOL
  SET myset ("A" = 1, "B" = 2);
END DATAPOOL;

=================
set declaration 3
=================

DATAPOOL
  SET myset ("A" = "a", "B" = "b");
END DATAPOOL;

==============================
set declaration with parameter
==============================

DATAPOOL
  SET myset1 {GLOBAL, INVALID=NONE} ("");
END DATAPOOL;

=================
color declaration
=================

DATAPOOL
  COLOR mycolor2 (
    INVALID = (red, black),
    < 0 = ("#fff", "#f00"),
    < foo.foo = ("#fff", "#000"),
    RANGE(0, <2.1) = ("#ffffff", "#00ff00"),
    2 = ("#ffffff", "#0000ff"),
    "mytext" = ( "#e0e0e0", "#e0e0e0" ),
    ELSE = ("#ffffff", "#0000ff")
  );
END DATAPOOL;

---
(source_file
  (datapool_block
    (colors_declaration
      (color_declaration
        (color_identifier)
        (color_set
          (color_set_item
            (tuple (identifier) (identifier)))
          (color_set_item
            (color_set_value (number))
            (tuple (string) (string)))
          (color_set_item
            (color_set_value
              (variable (identifier) (identifier)))
            (tuple (string) (string)))
          (color_set_item
            (color_set_range
              (color_set_value (number))
              (color_set_value (number)))
            (tuple (string) (string)))
          (color_set_item
            (color_set_value (number))
            (tuple (string) (string)))
          (color_set_item
            (color_set_value (string))
            (tuple (string) (string)))
          (color_set_item
            (tuple (string) (string))))))))
